Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ256DA106.h
#define _U1FRML_FRM3_POSITION                    0x00000003
#define _U1FRML_FRM3_MASK                        0x00000008
#define _U1FRML_FRM3_LENGTH                      0x00000001

#define _U1FRML_FRM4_POSITION                    0x00000004
#define _U1FRML_FRM4_MASK                        0x00000010
#define _U1FRML_FRM4_LENGTH                      0x00000001

#define _U1FRML_FRM5_POSITION                    0x00000005
#define _U1FRML_FRM5_MASK                        0x00000020
#define _U1FRML_FRM5_LENGTH                      0x00000001

#define _U1FRML_FRM6_POSITION                    0x00000006
#define _U1FRML_FRM6_MASK                        0x00000040
#define _U1FRML_FRM6_LENGTH                      0x00000001

#define _U1FRML_FRM7_POSITION                    0x00000007
#define _U1FRML_FRM7_MASK                        0x00000080
#define _U1FRML_FRM7_LENGTH                      0x00000001

#define _U1FRMH_FRM8_POSITION                    0x00000000
#define _U1FRMH_FRM8_MASK                        0x00000001
#define _U1FRMH_FRM8_LENGTH                      0x00000001

#define _U1FRMH_FRM9_POSITION                    0x00000001
#define _U1FRMH_FRM9_MASK                        0x00000002
#define _U1FRMH_FRM9_LENGTH                      0x00000001

#define _U1FRMH_FRM10_POSITION                   0x00000002
#define _U1FRMH_FRM10_MASK                       0x00000004
#define _U1FRMH_FRM10_LENGTH                     0x00000001

#define _U1TOK_EP_POSITION                       0x00000000
#define _U1TOK_EP_MASK                           0x0000000F
#define _U1TOK_EP_LENGTH                         0x00000004

#define _U1TOK_PID_POSITION                      0x00000004
#define _U1TOK_PID_MASK                          0x000000F0
#define _U1TOK_PID_LENGTH                        0x00000004

#define _U1TOK_EP0_POSITION                      0x00000000
#define _U1TOK_EP0_MASK                          0x00000001
#define _U1TOK_EP0_LENGTH                        0x00000001

#define _U1TOK_EP1_POSITION                      0x00000001
#define _U1TOK_EP1_MASK                          0x00000002
#define _U1TOK_EP1_LENGTH                        0x00000001

#define _U1TOK_EP2_POSITION                      0x00000002
#define _U1TOK_EP2_MASK                          0x00000004
#define _U1TOK_EP2_LENGTH                        0x00000001

#define _U1TOK_EP3_POSITION                      0x00000003
#define _U1TOK_EP3_MASK                          0x00000008
#define _U1TOK_EP3_LENGTH                        0x00000001

#define _U1TOK_PID0_POSITION                     0x00000004
#define _U1TOK_PID0_MASK                         0x00000010
#define _U1TOK_PID0_LENGTH                       0x00000001

#define _U1TOK_PID1_POSITION                     0x00000005
#define _U1TOK_PID1_MASK                         0x00000020
#define _U1TOK_PID1_LENGTH                       0x00000001

#define _U1TOK_PID2_POSITION                     0x00000006
#define _U1TOK_PID2_MASK                         0x00000040
#define _U1TOK_PID2_LENGTH                       0x00000001

#define _U1TOK_PID3_POSITION                     0x00000007
#define _U1TOK_PID3_MASK                         0x00000080
#define _U1TOK_PID3_LENGTH                       0x00000001

#define _U1SOF_CNT_POSITION                      0x00000000
#define _U1SOF_CNT_MASK                          0x000000FF
#define _U1SOF_CNT_LENGTH                        0x00000008

#define _U1SOF_CNT0_POSITION                     0x00000000
#define _U1SOF_CNT0_MASK                         0x00000001
#define _U1SOF_CNT0_LENGTH                       0x00000001

#define _U1SOF_CNT1_POSITION                     0x00000001
#define _U1SOF_CNT1_MASK                         0x00000002
#define _U1SOF_CNT1_LENGTH                       0x00000001

#define _U1SOF_CNT2_POSITION                     0x00000002
#define _U1SOF_CNT2_MASK                         0x00000004
#define _U1SOF_CNT2_LENGTH                       0x00000001

#define _U1SOF_CNT3_POSITION                     0x00000003
#define _U1SOF_CNT3_MASK                         0x00000008
#define _U1SOF_CNT3_LENGTH                       0x00000001

#define _U1SOF_CNT4_POSITION                     0x00000004
#define _U1SOF_CNT4_MASK                         0x00000010
#define _U1SOF_CNT4_LENGTH                       0x00000001

#define _U1SOF_CNT5_POSITION                     0x00000005
#define _U1SOF_CNT5_MASK                         0x00000020
#define _U1SOF_CNT5_LENGTH                       0x00000001

#define _U1SOF_CNT6_POSITION                     0x00000006
#define _U1SOF_CNT6_MASK                         0x00000040
#define _U1SOF_CNT6_LENGTH                       0x00000001

#define _U1SOF_CNT7_POSITION                     0x00000007
#define _U1SOF_CNT7_MASK                         0x00000080
#define _U1SOF_CNT7_LENGTH                       0x00000001

#define _U1CNFG1_PPB_POSITION                    0x00000000
#define _U1CNFG1_PPB_MASK                        0x00000003
#define _U1CNFG1_PPB_LENGTH                      0x00000002

#define _U1CNFG1_USBSIDL_POSITION                0x00000004
#define _U1CNFG1_USBSIDL_MASK                    0x00000010
#define _U1CNFG1_USBSIDL_LENGTH                  0x00000001

#define _U1CNFG1_UOEMON_POSITION                 0x00000006
#define _U1CNFG1_UOEMON_MASK                     0x00000040
#define _U1CNFG1_UOEMON_LENGTH                   0x00000001

#define _U1CNFG1_UTEYE_POSITION                  0x00000007
#define _U1CNFG1_UTEYE_MASK                      0x00000080
#define _U1CNFG1_UTEYE_LENGTH                    0x00000001

#define _U1CNFG1_PPB0_POSITION                   0x00000000
#define _U1CNFG1_PPB0_MASK                       0x00000001
#define _U1CNFG1_PPB0_LENGTH                     0x00000001

#define _U1CNFG1_PPB1_POSITION                   0x00000001
#define _U1CNFG1_PPB1_MASK                       0x00000002
#define _U1CNFG1_PPB1_LENGTH                     0x00000001

#define _U1CNFG2_UTRDIS_POSITION                 0x00000000
#define _U1CNFG2_UTRDIS_MASK                     0x00000001
#define _U1CNFG2_UTRDIS_LENGTH                   0x00000001

#define _U1CNFG2_UVCMPDIS_POSITION               0x00000001
#define _U1CNFG2_UVCMPDIS_MASK                   0x00000002
#define _U1CNFG2_UVCMPDIS_LENGTH                 0x00000001

