Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ256DA106.h
#define _G1DPW_DPW8_POSITION                     0x00000008
#define _G1DPW_DPW8_MASK                         0x00000100
#define _G1DPW_DPW8_LENGTH                       0x00000001

#define _G1DPW_DPW9_POSITION                     0x00000009
#define _G1DPW_DPW9_MASK                         0x00000200
#define _G1DPW_DPW9_LENGTH                       0x00000001

#define _G1DPW_DPW10_POSITION                    0x0000000A
#define _G1DPW_DPW10_MASK                        0x00000400
#define _G1DPW_DPW10_LENGTH                      0x00000001

#define _G1DPH_DPH_POSITION                      0x00000000
#define _G1DPH_DPH_MASK                          0x000007FF
#define _G1DPH_DPH_LENGTH                        0x0000000B

#define _G1DPH_DPH0_POSITION                     0x00000000
#define _G1DPH_DPH0_MASK                         0x00000001
#define _G1DPH_DPH0_LENGTH                       0x00000001

#define _G1DPH_DPH1_POSITION                     0x00000001
#define _G1DPH_DPH1_MASK                         0x00000002
#define _G1DPH_DPH1_LENGTH                       0x00000001

#define _G1DPH_DPH2_POSITION                     0x00000002
#define _G1DPH_DPH2_MASK                         0x00000004
#define _G1DPH_DPH2_LENGTH                       0x00000001

#define _G1DPH_DPH3_POSITION                     0x00000003
#define _G1DPH_DPH3_MASK                         0x00000008
#define _G1DPH_DPH3_LENGTH                       0x00000001

#define _G1DPH_DPH4_POSITION                     0x00000004
#define _G1DPH_DPH4_MASK                         0x00000010
#define _G1DPH_DPH4_LENGTH                       0x00000001

#define _G1DPH_DPH5_POSITION                     0x00000005
#define _G1DPH_DPH5_MASK                         0x00000020
#define _G1DPH_DPH5_LENGTH                       0x00000001

#define _G1DPH_DPH6_POSITION                     0x00000006
#define _G1DPH_DPH6_MASK                         0x00000040
#define _G1DPH_DPH6_LENGTH                       0x00000001

#define _G1DPH_DPH7_POSITION                     0x00000007
#define _G1DPH_DPH7_MASK                         0x00000080
#define _G1DPH_DPH7_LENGTH                       0x00000001

#define _G1DPH_DPH8_POSITION                     0x00000008
#define _G1DPH_DPH8_MASK                         0x00000100
#define _G1DPH_DPH8_LENGTH                       0x00000001

#define _G1DPH_DPH9_POSITION                     0x00000009
#define _G1DPH_DPH9_MASK                         0x00000200
#define _G1DPH_DPH9_LENGTH                       0x00000001

#define _G1DPH_DPH10_POSITION                    0x0000000A
#define _G1DPH_DPH10_MASK                        0x00000400
#define _G1DPH_DPH10_LENGTH                      0x00000001

#define _G1DPWT_DPWT_POSITION                    0x00000000
#define _G1DPWT_DPWT_MASK                        0x000007FF
#define _G1DPWT_DPWT_LENGTH                      0x0000000B

#define _G1DPWT_DPWT0_POSITION                   0x00000000
#define _G1DPWT_DPWT0_MASK                       0x00000001
#define _G1DPWT_DPWT0_LENGTH                     0x00000001

#define _G1DPWT_DPWT1_POSITION                   0x00000001
#define _G1DPWT_DPWT1_MASK                       0x00000002
#define _G1DPWT_DPWT1_LENGTH                     0x00000001

#define _G1DPWT_DPWT2_POSITION                   0x00000002
#define _G1DPWT_DPWT2_MASK                       0x00000004
#define _G1DPWT_DPWT2_LENGTH                     0x00000001

#define _G1DPWT_DPWT3_POSITION                   0x00000003
#define _G1DPWT_DPWT3_MASK                       0x00000008
#define _G1DPWT_DPWT3_LENGTH                     0x00000001

#define _G1DPWT_DPWT4_POSITION                   0x00000004
#define _G1DPWT_DPWT4_MASK                       0x00000010
#define _G1DPWT_DPWT4_LENGTH                     0x00000001

#define _G1DPWT_DPWT5_POSITION                   0x00000005
#define _G1DPWT_DPWT5_MASK                       0x00000020
#define _G1DPWT_DPWT5_LENGTH                     0x00000001

#define _G1DPWT_DPWT6_POSITION                   0x00000006
#define _G1DPWT_DPWT6_MASK                       0x00000040
#define _G1DPWT_DPWT6_LENGTH                     0x00000001

#define _G1DPWT_DPWT7_POSITION                   0x00000007
#define _G1DPWT_DPWT7_MASK                       0x00000080
#define _G1DPWT_DPWT7_LENGTH                     0x00000001

#define _G1DPWT_DPWT8_POSITION                   0x00000008
#define _G1DPWT_DPWT8_MASK                       0x00000100
#define _G1DPWT_DPWT8_LENGTH                     0x00000001

#define _G1DPWT_DPWT9_POSITION                   0x00000009
#define _G1DPWT_DPWT9_MASK                       0x00000200
#define _G1DPWT_DPWT9_LENGTH                     0x00000001

#define _G1DPWT_DPWT10_POSITION                  0x0000000A
#define _G1DPWT_DPWT10_MASK                      0x00000400
#define _G1DPWT_DPWT10_LENGTH                    0x00000001

#define _G1DPHT_DPHT_POSITION                    0x00000000
#define _G1DPHT_DPHT_MASK                        0x000007FF
#define _G1DPHT_DPHT_LENGTH                      0x0000000B

#define _G1DPHT_DPHT0_POSITION                   0x00000000
#define _G1DPHT_DPHT0_MASK                       0x00000001
#define _G1DPHT_DPHT0_LENGTH                     0x00000001

#define _G1DPHT_DPHT1_POSITION                   0x00000001
#define _G1DPHT_DPHT1_MASK                       0x00000002
#define _G1DPHT_DPHT1_LENGTH                     0x00000001

#define _G1DPHT_DPHT2_POSITION                   0x00000002
#define _G1DPHT_DPHT2_MASK                       0x00000004
#define _G1DPHT_DPHT2_LENGTH                     0x00000001

#define _G1DPHT_DPHT3_POSITION                   0x00000003
#define _G1DPHT_DPHT3_MASK                       0x00000008
#define _G1DPHT_DPHT3_LENGTH                     0x00000001

#define _G1DPHT_DPHT4_POSITION                   0x00000004
#define _G1DPHT_DPHT4_MASK                       0x00000010
#define _G1DPHT_DPHT4_LENGTH                     0x00000001

#define _G1DPHT_DPHT5_POSITION                   0x00000005
#define _G1DPHT_DPHT5_MASK                       0x00000020
#define _G1DPHT_DPHT5_LENGTH                     0x00000001

