Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ256DA106.h
#define _G1CLUT_CLUTRWEN_POSITION                0x00000008
#define _G1CLUT_CLUTRWEN_MASK                    0x00000100
#define _G1CLUT_CLUTRWEN_LENGTH                  0x00000001

#define _G1CLUT_CLUTTRD_POSITION                 0x00000009
#define _G1CLUT_CLUTTRD_MASK                     0x00000200
#define _G1CLUT_CLUTTRD_LENGTH                   0x00000001

#define _G1CLUT_CLUTBUSY_POSITION                0x0000000E
#define _G1CLUT_CLUTBUSY_MASK                    0x00004000
#define _G1CLUT_CLUTBUSY_LENGTH                  0x00000001

#define _G1CLUT_CLUTEN_POSITION                  0x0000000F
#define _G1CLUT_CLUTEN_MASK                      0x00008000
#define _G1CLUT_CLUTEN_LENGTH                    0x00000001

#define _G1CLUT_CLUTADR0_POSITION                0x00000000
#define _G1CLUT_CLUTADR0_MASK                    0x00000001
#define _G1CLUT_CLUTADR0_LENGTH                  0x00000001

#define _G1CLUT_CLUTADR1_POSITION                0x00000001
#define _G1CLUT_CLUTADR1_MASK                    0x00000002
#define _G1CLUT_CLUTADR1_LENGTH                  0x00000001

#define _G1CLUT_CLUTADR2_POSITION                0x00000002
#define _G1CLUT_CLUTADR2_MASK                    0x00000004
#define _G1CLUT_CLUTADR2_LENGTH                  0x00000001

#define _G1CLUT_CLUTADR3_POSITION                0x00000003
#define _G1CLUT_CLUTADR3_MASK                    0x00000008
#define _G1CLUT_CLUTADR3_LENGTH                  0x00000001

#define _G1CLUT_CLUTADR4_POSITION                0x00000004
#define _G1CLUT_CLUTADR4_MASK                    0x00000010
#define _G1CLUT_CLUTADR4_LENGTH                  0x00000001

#define _G1CLUT_CLUTADR5_POSITION                0x00000005
#define _G1CLUT_CLUTADR5_MASK                    0x00000020
#define _G1CLUT_CLUTADR5_LENGTH                  0x00000001

#define _G1CLUT_CLUTADR6_POSITION                0x00000006
#define _G1CLUT_CLUTADR6_MASK                    0x00000040
#define _G1CLUT_CLUTADR6_LENGTH                  0x00000001

#define _G1CLUT_CLUTADR7_POSITION                0x00000007
#define _G1CLUT_CLUTADR7_MASK                    0x00000080
#define _G1CLUT_CLUTADR7_LENGTH                  0x00000001

#define _G1CLUTWR_CLUTWR_POSITION                0x00000000
#define _G1CLUTWR_CLUTWR_MASK                    0x0000FFFF
#define _G1CLUTWR_CLUTWR_LENGTH                  0x00000010

#define _G1CLUTWR_CLUTWR0_POSITION               0x00000000
#define _G1CLUTWR_CLUTWR0_MASK                   0x00000001
#define _G1CLUTWR_CLUTWR0_LENGTH                 0x00000001

#define _G1CLUTWR_CLUTWR1_POSITION               0x00000001
#define _G1CLUTWR_CLUTWR1_MASK                   0x00000002
#define _G1CLUTWR_CLUTWR1_LENGTH                 0x00000001

#define _G1CLUTWR_CLUTWR2_POSITION               0x00000002
#define _G1CLUTWR_CLUTWR2_MASK                   0x00000004
#define _G1CLUTWR_CLUTWR2_LENGTH                 0x00000001

#define _G1CLUTWR_CLUTWR3_POSITION               0x00000003
#define _G1CLUTWR_CLUTWR3_MASK                   0x00000008
#define _G1CLUTWR_CLUTWR3_LENGTH                 0x00000001

#define _G1CLUTWR_CLUTWR4_POSITION               0x00000004
#define _G1CLUTWR_CLUTWR4_MASK                   0x00000010
#define _G1CLUTWR_CLUTWR4_LENGTH                 0x00000001

#define _G1CLUTWR_CLUTWR5_POSITION               0x00000005
#define _G1CLUTWR_CLUTWR5_MASK                   0x00000020
#define _G1CLUTWR_CLUTWR5_LENGTH                 0x00000001

#define _G1CLUTWR_CLUTWR6_POSITION               0x00000006
#define _G1CLUTWR_CLUTWR6_MASK                   0x00000040
#define _G1CLUTWR_CLUTWR6_LENGTH                 0x00000001

#define _G1CLUTWR_CLUTWR7_POSITION               0x00000007
#define _G1CLUTWR_CLUTWR7_MASK                   0x00000080
#define _G1CLUTWR_CLUTWR7_LENGTH                 0x00000001

#define _G1CLUTWR_CLUTWR8_POSITION               0x00000008
#define _G1CLUTWR_CLUTWR8_MASK                   0x00000100
#define _G1CLUTWR_CLUTWR8_LENGTH                 0x00000001

#define _G1CLUTWR_CLUTWR9_POSITION               0x00000009
#define _G1CLUTWR_CLUTWR9_MASK                   0x00000200
#define _G1CLUTWR_CLUTWR9_LENGTH                 0x00000001

#define _G1CLUTWR_CLUTWR10_POSITION              0x0000000A
#define _G1CLUTWR_CLUTWR10_MASK                  0x00000400
#define _G1CLUTWR_CLUTWR10_LENGTH                0x00000001

#define _G1CLUTWR_CLUTWR11_POSITION              0x0000000B
#define _G1CLUTWR_CLUTWR11_MASK                  0x00000800
#define _G1CLUTWR_CLUTWR11_LENGTH                0x00000001

#define _G1CLUTWR_CLUTWR12_POSITION              0x0000000C
#define _G1CLUTWR_CLUTWR12_MASK                  0x00001000
#define _G1CLUTWR_CLUTWR12_LENGTH                0x00000001

#define _G1CLUTWR_CLUTWR13_POSITION              0x0000000D
#define _G1CLUTWR_CLUTWR13_MASK                  0x00002000
#define _G1CLUTWR_CLUTWR13_LENGTH                0x00000001

#define _G1CLUTWR_CLUTWR14_POSITION              0x0000000E
#define _G1CLUTWR_CLUTWR14_MASK                  0x00004000
#define _G1CLUTWR_CLUTWR14_LENGTH                0x00000001

#define _G1CLUTWR_CLUTWR15_POSITION              0x0000000F
#define _G1CLUTWR_CLUTWR15_MASK                  0x00008000
#define _G1CLUTWR_CLUTWR15_LENGTH                0x00000001

#define _G1CLUTRD_CLUTRD_POSITION                0x00000000
#define _G1CLUTRD_CLUTRD_MASK                    0x0000FFFF
#define _G1CLUTRD_CLUTRD_LENGTH                  0x00000010

#define _G1CLUTRD_CLUTRD0_POSITION               0x00000000
#define _G1CLUTRD_CLUTRD0_MASK                   0x00000001
#define _G1CLUTRD_CLUTRD0_LENGTH                 0x00000001

#define _G1CLUTRD_CLUTRD1_POSITION               0x00000001
#define _G1CLUTRD_CLUTRD1_MASK                   0x00000002
#define _G1CLUTRD_CLUTRD1_LENGTH                 0x00000001

#define _G1CLUTRD_CLUTRD2_POSITION               0x00000002
#define _G1CLUTRD_CLUTRD2_MASK                   0x00000004
#define _G1CLUTRD_CLUTRD2_LENGTH                 0x00000001

#define _G1CLUTRD_CLUTRD3_POSITION               0x00000003
#define _G1CLUTRD_CLUTRD3_MASK                   0x00000008
#define _G1CLUTRD_CLUTRD3_LENGTH                 0x00000001

#define _G1CLUTRD_CLUTRD4_POSITION               0x00000004
#define _G1CLUTRD_CLUTRD4_MASK                   0x00000010
#define _G1CLUTRD_CLUTRD4_LENGTH                 0x00000001

#define _G1CLUTRD_CLUTRD5_POSITION               0x00000005
#define _G1CLUTRD_CLUTRD5_MASK                   0x00000020
#define _G1CLUTRD_CLUTRD5_LENGTH                 0x00000001

